Repository: OpenChain-Project/Curriculum-Translation-JP
Catalog: Curriculum-Translation-JP-omegat.tmx
Source language: en_us
Languages: ja

source: Free and FOSS Software licenses generally make source code available under terms that allow for modification and redistribution
ja: フリー、FOSSソフトウェアのライセンスは一般的に改変と再頒布を許容する条件の下でソースコードを取得できるようにします。

source: Freeware - software distributed under a proprietary license at no or very low cost
ja: フリーウェア－プロプライエタリ ライセンスの下に、無料もしくは非常に低コストで頒布されるソフトウェア

source: Freeware and Shareware are not FOSS
ja: フリーウェアとシェアウェアは、FOSSではありません。

source: Freeware and Shareware are not FOSS.The reason is that even though freeware and shareware are available without cost, they don't allow the users to make modifications to the software.In fact, many of the freeware and shareware contain similar license restrictions common in proprietary software.
ja: フリーウェアとシェアウェアはFOSSではありません。フリーウェアもシェアウェアもコストがかからずに取得可能ですが、使用者に対しソフトウェアの改変を許容していないことがこの理由です。実際には、 多くのフリーウェアとソフトウェアがプロプライエタリソフトウェアに共通する類似のライセンス制約を含んでいます。

source: Freeware or Shareware licensing should not be regarded as the same or compatible with FOSS licensing.
ja: フリーウェアおよびシェアウェアにおけるライセンスはFOSSライセンスと同じもの、もしくは両立可能なものとみなすべきではありません。

source: Freeware software is usually fully functional (no locked features) and available for unlimited use (no locking on days of usage)
ja: フリーウェアのソフトウェアは一般にすべての機能が使え（機能制約がない）、制限なく使える（使用日数における制約がない）ものです。

source: Freeware software licenses usually impose restrictions in relation to copying, distributing, and making derivative works of the software, as well as restrictions on the type of usage (personal, commercial, academic, etc.)
ja: フリーウェアのソフトウェアは（個人使用、商業目的、学術目的など）使用タイプについての制約と同様に、通常そのソフトウェアのコピー、頒布、二次的著作物の作成についての制約を課します。

source: Fulfillment of license obligations when product ships
ja: 製品出荷時のライセンスの義務の履行

source: Function call
ja: 関数呼び出し

source: GPL-2.0 project also includes code under BSD-3-Clause
ja: GPL-2.0 プロジェクトはBSD三条項ライセンス下のコードも含みます。

source: Gather relevant information
ja: 関連情報の収集

source: Geographical scope
ja: 地理的な範囲

source: Germany is one example.
ja: ドイツがその一例です。

source: Guidance
ja: 助言

source: Hardware
ja: ハードウェア

source: How can they raise questions about FOSS usage?
ja: FOSSの使用について彼らはどのように質問・疑問を上げることができるのか？

source: How do you want to use to the component?
ja: そのコンポーネントをどのように使いたいですか？

source: How is the FOSS component distributed?
ja: FOSSコンポーネントをどのように頒布するか？

source: However, the amount of information required depends on the size of your company and what you intend to do with the FOSS code.
ja: しかし、必要とされる情報量はFOSSコードを取り扱おうとする企業の規模に依存します。

source: However, patent protects functionality, and not abstract ideas.
ja: ただし、 特許は機能を保護するもので、抽象的なアイデアは保護しません。

source: Identification
ja: 確認（Identification）

source: Identification - Identify and track FOSS usage. This may take place through engineer requests, third party disclosures, or code scanning.
ja: 確認（Identification） － FOSSの使用を確認し追跡します。この作業はエンジニアからの要求、サード パーティの開示、もしくはコード スキャンを通じて発生します。

source: Identification of the origin and license of FOSS software
ja: FOSSソフトウェアの起源とライセンスの確認

source: Identify FOSS components and their origin and licenses
ja: FOSSコンポーネント、その起源とライセンスが確認される

source: Identify FOSS components for review
ja: レビュー対象のFOSSコンポ―ネントを特定する

source: Identify and Track FOSS Usage
ja: FOSSの使用方法を確認し、追跡する

source: Identify and begin tracking FOSS from all sources
ja: 全てのソースからFOSSを確認し、追跡を開始する

source: Identify obligations under FOSS licenses
ja: FOSSライセンス下の義務を確認する

source: If a second software module is combined with a GPLv2 licensed module that is not a derivative work of the GPLv2 licensed module, the second software module is not subject to GPLv2.
ja: 第二のソフトウェアモジュールをGPLv2でライセンスされたモジュールと組み合わせ、それがGPLv2でライセンスされたモジュールの二次的著作物でなければ、第二のソフトウェアモジュールはGPLv2の影響を受けません。

source: If from an external vendor:
ja: 外部ベンダーからの提供物の場合：

source: If one license requires you to do something and another prohibits doing that, the licenses conflict and are not compatible if the combination of the two software modules trigger the obligations under a license.
ja: 一つのライセンスが何かすることを要求し、他方のライセンスがそうすることを禁じている場合、それらは矛盾します。 その二つのソフトウェアモジュールの組み合わせがライセンス下での義務を発生させる場合には、二つのライセンスは両立しません。

source: If required by a FOSS license, appropriate notices should be prepared (often in a text file that accompanies the release).
ja: FOSSライセンスで求められる場合、適切な告知／通知／表示（notice）が準備されなければなりません（多くの場合、リリースに添付されるテキストファイルで）

source: If they choose the license you weren’t going to use, now you might have to consider if you should figure out who the original © holder is and get the code directly from them
ja: もし使おうとしていなかったライセンスを選択するなら、原著作の著作権保有者が誰かを明確にしてそこから直接コードを入手すべきかどうかをすぐに検討しなければいけないかもしれません。

source: If you do not delete - the provisions above, a recipient may use your version of this file under - the terms of any one of the MPL, the GPL or the LGPL.
ja: 対象者が上記の条項を削除しない場合、受領者は MPL または GPLもしくはLGPL ライセンスのいずれによってもこのファ イルを使用することができます。」

source: If you have independently developed your own software, then you may not need a copyright license if you can show the independent development and you had no access to the copyrighted work in question.
ja: ソフトウェアを独立して開発した場合、それが独立開発であり、著作権を有する被疑物件にアクセスしなかったことを示すことができれば著作権のライセンスはいらないかもしれません。

source: If you independently develop your own software, is it possible that you might need a copyright license from a third party for that software?
ja: 単独で自分のソフトウェアを開発した場合、第三者からそのソフトウェアについて著作権ライセンスを必要となるということはありえますか？

source: If you wish to allow use of your version of this file only - under the terms of either the GPL or the LGPL, and not to allow others to - use your version of this file under the terms of the MPL, indicate your - decision by deleting the provisions above and replace them with the notice - and other provisions required by the LGPL or the GPL.
ja: このファイルの他者による使用をGPLもしくはLGPLライセンスの条件によってのみ許可し、MPL による使用を許可したくない対象者は、上記の条項を削除することでその意思を示し、上記条項を GPLもしくはLGPL ライセンスで義務付けられている告知およびその他の条項に置き換えてください。

source: Implementing Compliance Practices
ja: コンプライアンス実務を実行に移す

source: Important questions to ask include:
ja: 以下のような問いが重要です：

source: In cases where no record is provided by the development team, a record can be created when the FOSS component is discovered
ja: 開発チームから提供される記録がない場合、FOSSコンポーネントが発見されたときに記録が生成される

source: In cases where source code must be made available, the company provides the accompanying source code through the mechanisms permitted under the FOSS license.
ja: ソースコードを入手可能とさせなければならない場合、企業は添付ソースコードをFOSSライセンス下で許可された仕組みを通じ提供します。

source: In cases where source code must be made available, the company verifies that the source code matches the binary files being distributed.
ja: ソースコードを入手可能とさせなければならない場合、企業はソースコードが頒布されるバイナリファイルと合致していることを確認します。

source: In our example, the company may conduct research into the identified FOSS component (e.g., review declared licenses, research origins of the FOSS component).
ja: ここでの例では、企業は確認されたFOSSコンポーネントについて調査を実施しています。（例えば、宣言されたライセンスのレビューや、FOSSコンポーネントの起源の調査など）

source: In such cases, the software may be viewed as being under a license rather than being in the public domain
ja: そのような場合、そのソフトウェアはパブリック ドメインというよりはあるライセンスの下にあるとみなされる場合があります。

source: In that case, you are free to choose the license that suits your need.
ja: そのようなケースでは、使用者がニーズに合わせてライセンスを事由に選択できます。

source: In the US public domain software can be included in FOSS code, but it should be noted that not all legal jurisdictions recognize the existence or permit the release of authorship under public domain.
ja: 米国ではパブリック ドメイン ソフトウェアに FOSS のコードが含まれる可能性がありますが、全ての法域がその存在を認識したり、パブリック ドメインの下で原作者の公開を許容したりするわけではないことは留意しなければなりません。

source: In the approval step of our example process, the review team communicates whether it approves of the FOSS usage in question, along with any associated conditions or obligations.
ja: ここでの例における承認ステップでは、レビューチームは問題のFOSSの使用をそれに伴う条件や義務に添って承認するかどうかを明らかにします。

source: In the previous step we removed FOSS usage that did not conform to company policy.
ja: 直前のステップでは企業のポリシーと合致しないFOSSの使用を取り除きました。

source: In this chapter, we will describe some common pitfalls to avoid in the FOSS compliance process.
ja: 本章ではFOSSコンプライアンスプロセスで避けるべき、共通的な落とし穴について説明していきます。

source: In this example, the FOSS review team may identify FOSS usage through review requests from engineers, from performing scans of internally-developed and third-party software, or reviewing code checked into development branches.
ja: この例では、FOSSレビューチームはエンジニア達からのレビュー リクエスト通じ、内部開発とサード パーティのソフトウェアのスキャンの実施や、開発のブランチにチェックインされたコードのレビューなどからFOSSの使用方法を確認します。F

source: In this slide of our example process, the company verifies that it has met its FOSS license obligations before release.
ja: 例としてあげたここでのプロセスについて、このスライドでは企業がリリース前にFOSSライセンスの義務を履行したことを確認していきます。

source: In this step, the FOSS review team reviews the facts collected in the previous steps and identifies the company’s obligations under the FOSS licenses.
ja: このステップでは、FOSSレビューチームが直前のステップで収集された事実をレビューし、FOSSライセンス下で企業が負うべき義務を確認します。

source: In this step, the company verifies that its distribution complies with its FOSS license obligations.
ja: このステップでは、企業が頒布物がFOSSライセンスの義務を履行していることを確認します。

source: In this step, we evaluate and identify the license obligations for FOSS usage that is retained.
ja: このステップでは使用することが保たれたFOSSのライセンスの義務を評価し、確認します。

source: In this situation you have to comply with both sets of license terms
ja: この状況においては両方の条項を満たさなければいけません。

source: Include appropriate authority levels in review staff
ja: レビュー スタッフに適切な権限（職権）レベルを含める

source: Inclusion of technology subject to export control
ja: 輸出管理対象となる技術に含まれているか

source: Incoming
ja: 入力

source: Incoming Software
ja: 入力ソフトウェア

source: Incoming requests are recorded
ja: 入力となるリクエストが登録される

source: Incoming:
ja: 入力：

source: Incorporation
ja: 取り込む（Incorporation）

source: Incorporation is when you copy portions of a FOSS component into your software product.
ja: 取り込み（Incorporation） FOSSコンポーネントの一部を自身のソフトウェアプロダクトにコピーすることです。

source: Increased knowledge of available FOSS solutions
ja: 有効なFOSSソリューションについての知識向上

source: Increased understanding of the benefits of FOSS and how it impacts your organization
ja: FOSSのメリットと組織へ与えるインパクトについての理解を高める

source: Increased understanding of the costs and risks associated with using FOSS
ja: FOSSを使うことと関連付けられるコストとリスクについての理解を高める

source: Inform the end user of their product on how to obtain a copy of the FOSS source code (when applicable, for example in the case of GPL and LGPL)
ja: 製品のエンドユーザ（最終利用者）にFOSSのソースコードの写しの入手方法について情報提供を行う（GPLやLGPLのケースのように適用される場合）

source: Initiate a FOSS Review
ja: FOSSレビューを開始する

source: Initiate a FOSS review process or contact the FOSS review team.
ja: FOSSレビュープロセスを開始するか、FOSSレビューチームにコンタクトを取ります。

source: Initiate a FOSS review process.
ja: FOSSレビュープロセスを開始します。

source: Initiating a FOSS Review
ja: FOSS レビューの開始

source: Inject material
ja: 素材を注入

source: Injecting
ja: 注入

source: Inserting
ja: 挿入する（Inserting）

source: Integrating
ja: 統合する（Integrating）

source: Intellectual Property (IP) pitfalls
ja: 知的財産（IP）に関する落とし穴

source: Intellectual Property Pitfalls
ja: 知的財産に関する落とし穴

source: Intended use in your product
ja: 自製品で意図している使用

source: Introduction
ja: 概要

source: Introduction to FOSS Compliance
ja: FOSSコンプライアンス概論

source: Introduction to FOSS Licenses
ja: FOSSライセンス概論

source: Is there a regular point in your development process where FOSS Reviews can begin?
ja: 開発プロセスにFOSSレビューが開始できる規則的ポイントがあるか？

source: It also explains a resource where you can find out more about some FOSS licenses.
ja: またここでは、いくつかのFOSSライセンスについてより多くを調べられるリソースについても説明しています。

source: It confirms that all FOSS license obligations have been or will be met
ja: すべてのFOSSライセンスの義務を履行された、もしくは履行されることをを確認します。

source: It explains a little bit about derivative works.
ja: また、二次的著作物についても若干触れています。

source: It explains how compliance works from first principles.
ja: コンプライアンスがどのように機能するか基本原則から説明します。

source: It involves understanding the licenses, having processes to support the license terms, and having processes to address any oversights or errors.
ja: これは、ライセンスについての理解、ライセンス条項を支えるプロセスの具備、見落としや誤りに対して取り組むプロセスの具備といったことを伴います。

source: It should be noted that this list of information looks quite large.
ja: 注目すべきは、この情報のリストが 非常に大きく見えることです。

source: JavaScript, web client, or other code that is downloaded to the user’s machine
ja: JavaScript、 Web クライアントもしくはその他ユーザ機器にダウンローされるコード

source: Kernel Space
ja: カーネル空間

source: Key Software Concepts for FOSS Review
ja: FOSSレビューに向けたソフトウェアの重要概念

source: Know your obligations (detect and track use of FOSS).
ja: 自らの義務を知る（FOSSの使用を発見し追跡する）こと。

source: Large entities tend to require more information than small entities.
ja: 大規模な組織体は小規模なものよりも多くの情報を必要とする傾向があります。

source: Legal
ja: リーガル

source: Legal team to identify and evaluate license obligations
ja: ライセンスの義務を特定し、評価する法務（リーガル）チーム

source: Legal teams analyze and determine license obligations and provide guidance
ja: 法務チームはライセンスの義務について分析、決定を下し、助言を提供します。

source: Legend
ja: 凡例

source: License Compatibility
ja: ライセンスの両立性

source: License Compliance pitfalls
ja: ライセンスコンプライアンスに関する落とし穴

source: License Reciprocity & Copyleft Licenses
ja: ライセンスの互恵性とコピーレフトライセンス

source: License and License URL
ja: ライセンスとライセンスのURL

source: License compatibility is the process of ensuring that license terms do not conflict.
ja: ライセンス両立性は、ライセンス条項に矛盾がないことを確かなものにするプロセス

source: License notice - a notice that acknowledges the license terms and conditions of the FOSS included in the product.
ja: ライセンス表示（License notice） －その製品に含まれるFOSSのライセンス条項や条件を知らせる表示（notice)。

source: License reciprocity means that the derivative work of the copyrighted work must be made available under the same license.
ja: ライセンスの互恵性は、著作権のある著作物の二次的著作物が同じライセンスの下で取得されなければならないことを意味しています。

source: Licenses
ja: ライセンス

source: Licenses that include reciprocity or Copyleft clauses include all versions of the GPL, LGPL, AGPL, MPL and CDDL
ja: 互恵性やコピーレフトの条項を組み入れたライセンスとしてGPL, LGPL, AGPL, MPLおよび CDDLの全てのバージョンが挙げられます。

source: Likewise, the engineering team may need assistance in implementing guidance from the FOSS review team.
ja: 同じくエンジニアリングチームは、FOSSレビューチームからの助言を実行に移す際に支援を必要とするかもしれません。

source: Limited monopoly to incentivize innovation
ja: イノベーションを奨励するための限定された独占権

source: Linking
ja: リンクする（Linking）

source: Linking is when you link or join a FOSS component with your software product.
ja: リンクとは自身のソフトウェアプロダクトとFOSSコンポーネントをリンク（link）もしくは接合（join）することです。

source: List and describe important business practices of a FOSS Compliance Program.
ja: FOSSコンプライアンスプログラムで重要な業務を挙げ、その内容を述べてください

source: List of dependencies
ja: 依存性のリスト

source: Maintain modified versions (derivative works) under the same license
ja: 改変版（二次的著作物）を同じライセンス下に維持すること

source: May also include contractual terms regarding warranties, indemnification, support, upgrade, maintenance
ja: 保証、免責、サポート、アップグレード、保守に関する契約事項も含まれる場合がある

source: Merging
ja: 結合する（Merging）

source: Modification
ja: 改変する（Modification）

source: Modification is when you make changes to a FOSS component.
ja: 改変とはFOSSコンポーネントに変更を加えることです。

source: Modification notice – a notice that you have made modifications to the source code of a file, such as adding your copyright notice to the top of the file.
ja: 改変告知（Modification notice） －ファイルのソースコードに対して改変を実施したという告知。たとえばファイルの上部に著作権表示を加える、など。

source: Modifications may constitute a derivative work, and FOSS authors may limit or place obligations on modifications
ja: 改変が二次的著作物を生み出す場合があります。そしてFOSS の著作者は改変において義務を課したり制限したりすることもあります。

source: Modifications may trigger FOSS obligations, such as:
ja: 改変でFOSSの義務が発動されるトリガー：

source: Modified versions must have a different name to avoid confusion
ja: 混乱を避けるために、改変版の名前が異なる名前でなければらないこと

source: Modify the material
ja: 素材を改変

source: Most companies are very leery of Shareware, because Shareware vendors often approach companies for large license payments after the software has freely propagated within their organizations.
ja: 大半の企業は、シェアウェアを非常に警戒します。そのソフトウェアが組織内で自由に広まってしまった後でそのシェアウェア ベンダーが大口ライセンスへの支払いを迫ることがしばしばあるためです。

source: Most important copyright concepts for software are: right to reproduce, right to make creative works (or right to modify), and right to distribute.
ja: ソフトウェアについての著作権で重要なのは： 複製する権利、二次的著作物を作成する（もしくは改変する）権利および頒布する権利です。

source: Mozilla tri-license
ja: Mozilla 3ライセンス（tri-license）

source: Multi-Licensing
ja: マルチ ライセンス

source: Multi-license refers to the practice where software is made available under multiple licenses.
ja: マルチライセンスはソフトウェアを複数のライセンスの下で使うことができる慣行のことを言います。

source: Multi-licensing refers to the practice of distributing software under two or more different sets of terms and conditions
ja: マルチライセンスはソフトウェアを2つ以上の異なる条項や条件のセットの下で頒布する慣行をいいます。

source: Name some copyleft-style licenses.
ja: コピーレフトの形態をとるライセンスの名称をいくつか挙げてください。

source: Name some permissive FOSS licenses.
ja: パーミッシブなライセンスの名称をいくつか挙げてください。

source: Note that this section provides a detailed example of what may take place in a large enterprise.
ja: このセクションは大規模なエンタープライズで生じうる、詳細な例を提供します。

source: Note: The interpretation of what constitutes a “derivative work” or a “distribution” is subject to debate in the FOSS community and within FOSS legal circles
ja: 注：何をもって「二次的著作物」、「頒布」とするかの解釈はFOSSコミュニティとFOSSの法的領域で考慮された内容に依存します。

source: Note: This process may also start when receiving FOSS-based software from outside vendors.
ja: 注：このプロセスは外部ベンダーからFOSSベースのソフトウェアを受領した時にも開始される場合があります。

source: Note: This should not be confused for situations in which a licensor imposes more than one license, and you must comply with all of them
ja: 注：ライセンサ（ライセンス供与者）が一つ以上のライセンスを課すといったことや、全てのライセンスを満たさなければならないといった状況ではないので、混同しないようにしてください。

source: Notice of modification
ja: 改変の告知

source: Notices
ja: 告知／通知／表示（Notice）

source: Notices & Attributions
ja: 各種告知／通知／表示（Notices）および帰属（Attributions）

source: Notices - Prepare notices as required by FOSS licenses.
ja: 告知／通知／表示（Notice）－FOSSライセンスで求められる形で告知／通知／表示を準備します。

source: Notices may include attribution notices, modification notices, or offers for source code.
ja: 告知／通知／表示（notice)には属性表示や改変告知やソースコードに対する申し出（offer）が含まれます。

source: Notices, such as text in comments in file headers, often provide authorship and licensing information.
ja: 告知／通知／表示（Notices）は、しばしば著作者やライセンスに関する情報を提供します。例えばファイルのヘッダーにあるコメント行の文字列などがあります。

source: Obligations to provide accompanying source code are met
ja: 添付ソースコードの提供義務が履行される

source: Offering training to engineering staff to bring awareness to compliance issues and to the different types and categories of FOSS licenses and the implications of including FOSS source code in proprietary source code
ja: エンジニアリングスタッフが、コンプライアンスの論点、各種FOSSライセンス、プロプライエタリ ソースコードに対するFOSSソースコードを内包した形での実装などを意識できるよう、トレーニングを提供する。

source: Often the public domain declaration is accompanied by other terms, such as warranty disclaimers.
ja: 多くの場合、パブリック ドメイン宣言は保証免責条項など他の条項を伴います。

source: Once a FOSS component has been approved for usage in a product, it should be added to the software inventory for that product
ja: 製品内での使用に対しFOSSが承認されたら、それはその製品に対するソフトウェア一覧（inventory)に追加される必要があります。

source: Once an audit report is produced that confirms the origin and licensing of source code, the review team should flag and review any issues under the company FOSS policy.
ja: ソースコードの起源とライセンスを確認した監査レポートが作成されると、レビューチームは企業のFOSSポリシーの下で全ての問題にフラグををつけレビューをする必要があります。

source: Once the proposed FOSS usage has been fully assessed, the legal team will then have the necessary information on which to make its judgments.
ja: 一度提案されたFOSSの使用が十分査定されれば、リーガルチームは判断を下す際に必要な情報を保有するようになります。

source: One example is that the GPLv2 extends its obligations to "derivative works."
ja: 一つの例は、GPLv2の義務が「二次的著作物」におよぶ場合です。

source: One popular set of licenses are those approved by the FOSS Initiative (OSI) based on their FOSS Definition (OSD).
ja: ライセンスで良く知られているものとしてFOSS Iイニシアチブ（OSI)が 、彼らのFOSS定義（OSD）に基づき承認したものが挙げられます。

source: Optimizing
ja: 最適化

source: Organizations that have been successful at FOSS compliance have created their own FOSS Compliance Programs (consisting of policies, processes, training and tools) to:
ja: FOSSコンプライアンスを成功させてきた組織は （ポリシー、プロセス、トレーニングやツールなどから成る）自身のFOSSコンプライアンス プログラムを作り上げています。それには以下のような意図があります。

source: Original download URL
ja: 原本のダウンロード先URL

source: Other Licensing Situations
ja: その他のライセンシングを取り巻く状況

source: Other examples: MIT, Apache-2.0
ja: その他の例：MITライセンス、Apache-2.0ライセンス

source: Other names being used include "hereditary", "copyleft", "share-alike", and pejoratively"viral."
ja: その他の言い方として、「遺伝的」、「コピーレフト」、「継承」そして非難的な意味で「ウィルス性」といったものがあります。

source: Other parties who want to use the technology may seek a patent license (which may grant rights to use, make, have made, sell, offer for sale, and import the technology)
ja: 他者がそのテクノロジを使いたいという場合、特許ライセンス（使用権、作る・作らせる権利（Have made権）、販売・販売申し入れの権利およびその技術を輸入する権利などを供与）を求めることができる。

source: Other specialists or representatives that may be impacted by FOSS-related issues, such as commercial licensing, compliance or business planning teams.
ja: その他に、商用ライセンスやコンプライアンスおよびビジネス企画チームなどFOSSに関連する論点で影響を受けうる専門家、代表者も想定されます。

source: Outcome:
ja: 成果：

source: Outgoing Software
ja: 出力ソフトウェア

source: Outgoing:
ja: 出力：

source: Oversight for FOSS Compliance Program, creation of policy, and compliance decisions
ja: FOSSコンプライアンス プログラムに対する監督、ポリシーの策定およびコンプライスに関わる意思決定

source: Package name
ja: パッケージ名

source: Packaging
ja: パッケージ化（Packaging）

source: Pairing
ja: 対合（Pairing）

source: Pasting
ja: 貼り付ける（Pasting）

source: Patent concepts in software
ja: ソフトウェアにおける特許の概念

source: Patent holder can exclude others from practicing the patent, regardless of whether the others have independently created the product.
ja: 特許保有者は他者の作品が独立かどうかに関係なく、他者が特許を実施することを排除できます。

source: Patent protects method of operation, such as computer program.
ja: 特許はコンピュータ プログラムのような演算方法を保護します。

source: Patents protect functionality - this can include a method of operation, such as a computer program
ja: 特許は、機能を保護する－これには、コンピュータ プログラムのような演算方法が含まれる

source: Patents: useful inventions that are novel, useful, non-obvious
ja: 特許権（パテント）：新規性、有用性、非自明性をもつ有益な発明

source: Performing FOSS review and identifying license obligations
ja: FOSSレビューの実施と、ライセンスの義務の確認

source: Performing Reviews
ja: レビューを実施する

source: Performing reviews
ja: レビューの実施（Performing reviews）

source: Performing reviews - Assess and determine obligations for FOSS usage.
ja: レビューの実施－FOSSの使用に対する義務をを査定し決定します。

source: Permissive FOSS Licenses
ja: パーミッシブな（許容型の）FOSSライセンス

source: Permissive FOSS license - a term used often to describe minimally restrictive FOSS licenses
ja: パーミッシブなFOSSライセンス－制約が最小限にとどまるライセンスを言及する時に用いられる用語

source: Perpetual or time limited duration
ja: 無期限か、期限付きか

source: Please note that each chapter has “Check Your Understanding” slides with questions and answers in the slide notes.
ja: 各章には質問形式の「理解度チェック」のスライドを設けていますのでご留意ください。回答はスライドのノート欄に記載されています。

source: Post publication
ja: 公開後の

source: Pre-Distribution Verifications
ja: 頒布前の検証

source: Pre-distribution verifications
ja: 頒布前の確認

source: Pre-distribution verifications – Review distributions for compliance before release.
ja: 頒布前の確認－頒布物のリリース前のコンプライアンスをレビューします。

source: Pre-loaded onto hardware
ja: 最初からハードウェアに組み込む

source: Pre-requisites:
ja: 前提条件：

source: Prepare appropriate notices for any FOSS used in a product release:
ja: 製品リリースに当たり、適切な告知／通知／表示（notice）を準備する：

source: Prepare business processes and sufficient staff to handle:
ja: ビジネスプロセスおよび以下の対応をする十分な数のスタッフを準備する：

source: Preserve audit report findings and mark resolved issues as ready for the next step (i.e. Approval)
ja: 監査レポートで発見したことを保存し、解決された問題を次のステップへの準備ができたものとして示すことができる

source: Preventative measures include training of engineering staff, and building regular audits or scans into the development process.
ja: 予防策として、エンジニアリング スタッフへのトレーニング提供や、開発プロセスにおける監査やスキャンの定期的な実施といったことがあります。

source: Process Overview
ja: プロセス概要

source: Product Manager
ja: プロダクトマネージャ

source: Program Manager
ja: プログラムマネージャ

source: Proprietary
ja: プロプライエタリ

source: Proprietary License or Closed Source
ja: プロプライエタリ ライセンスもしくはクローズド ソース

source: Proprietary Software
ja: プロプライエタリ ソフトウェア
